Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.13.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/shimulhumayun/atlantis-iam-user-poc/3/default/iam-user-default.tfplan\"" in "/home/atlantis/.atlantis/repos/shimulhumayun/atlantis-iam-user-poc/3/default": exit status 1

╷
Terraform used the selected providers to generate the following execution
│ Error: invalid value for name (must only contain alphanumeric characters, hyphens, underscores, commas, periods, @ symbols, plus and equals signs)
│ 
plan. Resource actions are indicated with the following symbols:
  + create
│   with aws_iam_user.this["hdfhbdfh!.at.gmail.com"],
│   on main.tf line 6, in resource "aws_iam_user" "this":

Terraform planned the following actions, but then encountered a problem:
│    6:   name     = each.key
│ 

  # aws_iam_user.this["demo.user.001"] will be created
╵
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "demo.user.001"
      + path          = "/"
      + tags          = {
          + "created_by" = "atlantis-poc"
          + "team"       = "platform"
        }
      + tags_all      = {
          + "created_by" = "atlantis-poc"
          + "team"       = "platform"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user.this["demo.user.002"] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "demo.user.002"
      + path          = "/"
      + tags          = {
          + "created_by" = "atlantis-poc"
          + "team"       = "data"
        }
      + tags_all      = {
          + "created_by" = "atlantis-poc"
          + "team"       = "data"
        }
      + unique_id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```
</details>